uhnp/src/InformationRegisters/ВерсииГрафиковРасчетов/ВерсииГрафиковРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииГрафиковРасчетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОпорныйГрафик</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВерсияГрафика</name>
    <type>
      <types>DefinedType.ВерсияГрафика</types>
    </type>
  </resources>
  <dimensions>
    <name>ПредметГрафика</name>
    <type>
      <types>DefinedType.ПредметГрафика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ВидыФинансовыхИнструментов/ВидыФинансовыхИнструментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыФинансовыхИнструментов</name>
  <enumValues>
    <name>РасчетыСКонтрагентами</name>
  </enumValues>
  <enumValues>
    <name>КредитнаяЛиния</name>
  </enumValues>
  <enumValues>
    <name>КредитПолученный</name>
  </enumValues>
  <enumValues>
    <name>ЗаемПолученный</name>
  </enumValues>
  <enumValues>
    <name>Овердрафт</name>
  </enumValues>
  <enumValues>
    <name>ЗаемВыданный</name>
  </enumValues>
  <enumValues>
    <name>Депозит</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияПростая</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияВозобновляемая</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКредитнаяЛинияОнкольная</name>
  </enumValues>
  <enumValues>
    <name>АккредитивВыданный</name>
  </enumValues>
  <enumValues>
    <name>АккредитивПолученный</name>
  </enumValues>
  <enumValues>
    <name>ГарантияВыданная</name>
  </enumValues>
  <enumValues>
    <name>ГарантияПолученная</name>
  </enumValues>
  <enumValues>
    <name>МНО</name>
  </enumValues>
  <enumValues>
    <name>Вексель</name>
  </enumValues>
  <enumValues>
    <name>Акция</name>
  </enumValues>
  <enumValues>
    <name>Облигация</name>
  </enumValues>
  <enumValues>
    <name>Факторинг</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеПривлечение</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>ВалютныйСвоп</name>
  </enumValues>
  <enumValues>
    <name>ВалютныйФорвард</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеЦенныеБумаги</name>
  </enumValues>
  <enumValues>
    <name>ВалютноПроцентныйСвоп</name>
  </enumValues>
  <enumValues>
    <name>ЛизингПолученный</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ФормаВекселя/ФормаВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФормаВекселя</name>
  <enumValues>
    <name>Простой</name>
  </enumValues>
  <enumValues>
    <name>Переводной</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОперацийПоступлениеВекселя/ВидыОперацийПоступлениеВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПоступлениеВекселя</name>
  <enumValues>
    <name>ВыпускПростыхВекселей</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПереводныхВекселей</name>
  </enumValues>
  <enumValues>
    <name>АкцептПереводныхВекселей</name>
  </enumValues>
  <enumValues>
    <name>ПриобретениеВекселей</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыОперацийВыбытиеВекселя/ВидыОперацийВыбытиеВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВыбытиеВекселя</name>
  <enumValues>
    <name>ПредъявлениеВекселяКПогашению</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВекселя</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеВекселя</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Documents/ПоступлениеВекселя/ПоступлениеВекселя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеВекселя</name>
  <basedOn>Catalog.ЦенныеБумаги</basedOn>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПланОплат</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиГрафики</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентами</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДоходыРасходыПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентДоходыРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <registerRecords>InformationRegister.СтатусыАкцептаПереводныхВекселей</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКлиентамиПоДокументам</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщикамиПоДокументам</registerRecords>
  <registerRecords>InformationRegister.ВерсииГрафиковРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияКонтрагентКонтрагент</registerRecords>
  <registerRecords>InformationRegister.РасшифровкиГрафиковЦБ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСКонтрагентамиФакт</registerRecords>
  <attributes>
    <name>Акцептован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаНоминала</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПоступлениеВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОснованияПоступления</name>
    <type>
      <types>EnumRef.ОснованияПоступленияВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаНачисленияПроцентов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияНачисленияПроцентов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтПремия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорАкцепта</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовОснование</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетовСТретьейСтороной</name>
    <type>
      <types>DefinedType.ОбъектРасчетовУХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйДоходРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредусмотренПроцентныйДоход</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаДоходности</name>
    <comment>Вычисляется для дисконтных векселей; для процентных указана на векселе.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетВзаиморасчетовСПлательщиком</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущаяСтоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ТретьяСторона</name>
    <comment>Третья сторона по переводному векселю. Для вида операции &quot;Акцепт переводного векселя&quot; - векселедатель, для вида операции &quot;Выпуск переводного векселя&quot; - плательщик.</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФинансовыйИнструмент</name>
    <type>
      <types>CatalogRef.ЦенныеБумаги</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаВекселя</name>
    <type>
      <types>EnumRef.ФормаВекселя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРасчетов</name>
    <type>
      <types>DefinedType.ОбъектРасчетовФИРСБУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>График</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>Сумма начисления</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ВидСчетаФИ</name>
      <type>
        <types>CatalogRef.ВидыСчетовФИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОпераций</name>
    <attributes>
      <name>ОперацияГрафика</name>
      <type>
        <types>CatalogRef.ОперацииГрафиковДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Проценты</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентыУплачено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗадолженности</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентнаяСтавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/CommonModules/ФинансовыеИнструментыФормыВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

#Область ЗаполнениеДокументовЦБ

Процедура ОбработатьСтрокуЦБ(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения) Экспорт

	ЗаполнитьКэшируемыеЗначения(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения);
	ЗаполнитьКоличество(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения);
	ЗаполнитьНКД(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения);
	РассчитатьСтоимостьНоминала(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения);
	РассчитатьСтоимость(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения);
	РассчитатьПремию(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения);	
	
КонецПроцедуры

#КонецОбласти

#Область РасчетГрафика 

Функция ПолучитьГрафик(СтруктураДействий, КонтекстВерсии, ПараметрыГрафика = Неопределено) Экспорт

	Перем ТабГрафик, ОсновнойДолг, ФинансовыйИнструмент, Выданный, ДатаФактическихДанных, КонтекстПроценты;

	ЕстьПроценты = ПараметрыГрафика.ЕстьПроценты; 
	ЕстьКомиссии = ПараметрыГрафика.ЕстьКомиссии; 
	ЕстьШтрафы = ПараметрыГрафика.ЕстьШтрафы;
	
	Если Не ПараметрыГрафика.Свойство("ФинансовыйИнструмент", ФинансовыйИнструмент) Тогда
		ФинансовыйИнструмент = КонтекстВерсии.ФинансовыйИнструмент;
	КонецЕсли;
	
	Если Не ПараметрыГрафика.Свойство("КонтекстПроценты", КонтекстПроценты) Тогда
		КонтекстПроценты = КонтекстВерсии;
	КонецЕсли;
	
	ВидФИ = ФинансовыйИнструмент.ВидФинансовогоИнструмента;
	
	Если Не ПараметрыГрафика.Свойство("ТекущийГрафик", ТабГрафик) Тогда
		ТабГрафик = СоздатьШаблонГрафика(ЕстьПроценты, ЕстьКомиссии, ЕстьШтрафы);
	КонецЕсли;
	
	Если ДатаФактическихДанных = Неопределено Тогда
		ДатаФактическихДанных = Дата(1,1,1);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьОсновнойДолгЦБ", ОсновнойДолг) Тогда
		ДобавитьОперацииОсновногоДолгаЦБ(ТабГрафик, ОсновнойДолг, ДатаФактическихДанных);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("РассчитатьПроценты") Тогда
		
		ЭтоЦБ = Перечисления.ВидыФинансовыхИнструментов.ПолучитьВидыЦенныхБумаг().НайтиПоЗначению(ВидФИ) <> Неопределено;
		Если ЭтоЦБ Тогда
			ПараметрыРасчетаСтавки = СтруктураПараметровРасчетаПроцентовНоминалаЦБ(ФинансовыйИнструмент, КонтекстВерсии);
		КонецЕсли;
		
		ЗаполнитьРассчитатьПроценты(КонтекстПроценты, ПараметрыРасчетаСтавки, ДатаФактическихДанных);
		
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("ЗаполнитьПроценты") Тогда
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(КонтекстПроценты.Проценты, ТабГрафик);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("СвернутьГрафик") Тогда
		СвернутьГрафик(ТабГрафик, ЕстьПроценты, ЕстьКомиссии, ЕстьШтрафы);
	КонецЕсли;
	
	Если СтруктураДействий.Свойство("РассчитатьСальдо") Тогда
		РассчитатьСальдоГрафика(ТабГрафик, ЕстьПроценты, ЕстьКомиссии, ЕстьШтрафы);
	КонецЕсли;
	
	Возврат ТабГрафик;

КонецФункции

Функция СтруктураПараметровРасчетаПроцентовНоминалаЦБ(КонтекстФИ, КонтекстВерсииГрафика) Экспорт
		
	ТабОсновнойДолг = СоздатьШаблонГрафика(Истина, Ложь, Ложь);
	
	КонтекстОсновнойДолг = Новый Структура("ДатаВыпуска,ДатаПогашения,ОсновнойДолгПолучение,ОсновнойДолгВозврат",
											КонтекстФИ.ДатаВыпуска, 
											КонтекстФИ.СрокПогашения, 
											КонтекстФИ.Номинал,
											КонтекстФИ.Номинал
										);

	ДобавитьОперацииОсновногоДолгаЦБ(ТабОсновнойДолг, КонтекстОсновнойДолг);
	
	ТабОсновнойДолг.Колонки.ОсновнойДолгПолучение.Имя = "Приход";
	ТабОсновнойДолг.Колонки.ОсновнойДолгВозврат.Имя = "Расход";
	
	Результат = ФинансоваяМатематикаКлиентСервер.СтруктураПараметровРасчетаПроцентов();
	
	Результат.ДатаНачала 		= КонтекстФИ.ДатаВыпуска;
	Результат.ДатаОкончания 	= КонтекстФИ.СрокПогашения;
	
	Результат.ПравилоПереноса 					= КонтекстВерсииГрафика.ПереносДатСНерабочихДней;
	Результат.ИзменятьПроцентныйПериод 			= КонтекстВерсииГрафика.ИзменяетсяДлительностьПроцентногоПериодаПриПереносе;
	Результат.ПроизводственныйКалендарь			= КонтекстВерсииГрафика.ПроизводственныйКалендарь;
	Результат.ПериодичностьУплаты 				= КонтекстВерсииГрафика.ПериодичностьУплатыПроцентов;
	Результат.ПериодичностьНачисленияПроцентов	= ?(КонтекстФИ.НачислениеПроцентовНаОтчетныеДаты, КонтекстФИ.ПериодичностьНачисленияПроцентов, Неопределено);
	Результат.ДатаОтсчетаПроцентныхПериодов 	= КонтекстВерсииГрафика.ДатаОтсчетаПроцентныхПериодов;
	
	Результат.ДатаПервойВыборки = КонтекстФИ.ДатаВыпуска;
	Результат.ДатаНачалаДействия = КонтекстФИ.ДатаВыпуска;
	Результат.ДатаПервогоПогашения = КонтекстФИ.СрокПогашения;
	Результат.ТочкаОтсчетаСдвигаДатыУплаты = КонтекстВерсииГрафика.ТочкаОтсчетаСдвигаДатыУплаты;
	Результат.СдвигДатыУплаты = КонтекстВерсииГрафика.СдвигДатыУплатыПроцентов;
	Результат.ТипПроцентнойСтавки = КонтекстВерсииГрафика.ТипПроцентнойСтавки;
	Результат.ТочкаОтсчетаДатыФиксацииСтавки = КонтекстВерсииГрафика.ТочкаОтсчетаДатыФиксацииСтавки;
	Результат.СдвигДатыФиксацииСтавки = КонтекстВерсииГрафика.СдвигДатыФиксацииСтавки;
	Результат.ПроцентнаяСтавка = КонтекстВерсииГрафика.ПроцентнаяСтавка;
	Результат.ПорядокОпределенияСтавки = КонтекстВерсииГрафика.ПорядокОпределенияСтавки;
	Результат.ИндикативнаяСтавка = КонтекстВерсииГрафика.ИндикативнаяСтавка;
	Результат.ПлавающаяСтавкаМинимум = КонтекстВерсииГрафика.ПлавающаяСтавкаМинимум;
	Результат.ПлавающаяСтавкаМаксимум = КонтекстВерсииГрафика.ПлавающаяСтавкаМаксимум;
	Результат.РучноеУправлениеИзменениямиСтавки = КонтекстВерсииГрафика.РучноеУправлениеИзменениямиСтавки;
	Результат.ПроцентныеСтавки = КонтекстВерсииГрафика.ПроцентныеСтавки.Выгрузить();
	Результат.ВыплачиватьПроцентыПериодически = КонтекстВерсииГрафика.ВыплачиватьПроцентыПериодически;
	Результат.ВыплачиватьПроцентыВДатыПогашенияТела = КонтекстВерсииГрафика.ВыплачиватьПроцентыВДатыПогашенияТела;
	Результат.БазаДляРасчетаПроцентов = КонтекстВерсииГрафика.БазаДляРасчетаПроцентов;
	Результат.ОперацииИзмененияБазы = ТабОсновнойДолг;
	Результат.ГраницаФактическихДанных = Дата(1,1,1);
	Результат.ДатаПоследнегоНачисления = КонтекстФИ.ДатаВыпуска;
	Результат.СуммаНакопленнойЗадолженности = 0;
	
	Результат.ИмяКолонкиПриход = "ОсновнойДолгПолучение"; 
	Результат.ИмяКолонкиРасход = "ОсновнойДолгВозврат"; 
	
	Если КонтекстВерсииГрафика.ПериодичностьУплатыПроцентов = ПредопределенноеЗначение("Перечисление.Периодичность.День") Тогда
		Результат.Вставить("ЧислоДнейКупонногоПериода", КонтекстВерсииГрафика.ЧислоДнейКупонногоПериода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#Область ОперацииРасчетаГрафика 

Функция ЗаполнитьРассчитатьПроценты(КонтекстВерсии, ПараметрыРасчета, ДатаФактическихДанных = Неопределено) Экспорт

	Если ДатаФактическихДанных = Неопределено Тогда
		ДатаФактическихДанных = Дата(1,1,1);
	КонецЕсли;
	
	Объект = КонтекстВерсии;
		
	ТаблицаПроцентов = ФинансоваяМатематика.ПолучитьТаблицуПроцентов(ПараметрыРасчета);
	// Перенесем таблицу процентов в таблицу графика.
	ТаблицаПроцентов.Колонки.База.Имя = "СуммаЗадолженности";
	Объект.Проценты.Очистить();
	
	Для Каждого ТекСтрокаТаблицыПроцентов Из ТаблицаПроцентов Цикл
		
		Если ДатаФактическихДанных >= ТекСтрокаТаблицыПроцентов.ДатаПлатежа Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Проценты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТаблицыПроцентов);
		НоваяСтрока.Дата = ТекСтрокаТаблицыПроцентов.ДатаНачисления;
		НоваяСтрока.ПроцентыНачислено = ТекСтрокаТаблицыПроцентов.Сумма;
		
		Если ТекСтрокаТаблицыПроцентов.ДатаНачисления = ТекСтрокаТаблицыПроцентов.ДатаПлатежа Тогда
			
			НоваяСтрока.ПроцентыУплачено = ТекСтрокаТаблицыПроцентов.Сумма;
			
		Иначе
			
			НоваяСтрока = Объект.Проценты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрокаТаблицыПроцентов);
			НоваяСтрока.Дата = ТекСтрокаТаблицыПроцентов.ДатаПлатежа;
			НоваяСтрока.ПроцентыУплачено = ТекСтрокаТаблицыПроцентов.Сумма;
			
		КонецЕсли;
		
	КонецЦикла;

КонецФункции

Функция ДобавитьОперацииОсновногоДолгаЦБ(График, ОсновнойДолг, ДатаФактическихДанных = Неопределено) Экспорт

	Если ДатаФактическихДанных = Неопределено Тогда
		ДатаФактическихДанных = Дата(1,1,1);
	КонецЕсли;
	
	Если ДатаФактическихДанных < ОсновнойДолг.ДатаВыпуска Тогда
	
		СтрокаТаб = График.Добавить();
		СтрокаТаб.Дата = ОсновнойДолг.ДатаВыпуска;
		СтрокаТаб.ОсновнойДолгПолучение = ОсновнойДолг.ОсновнойДолгПолучение;
		
	КонецЕсли;
	
	Если ДатаФактическихДанных < ОсновнойДолг.ДатаПогашения Тогда
		
		СтрокаТаб = График.Добавить();
		СтрокаТаб.Дата = ОсновнойДолг.ДатаПогашения;
		СтрокаТаб.ОсновнойДолгВозврат = ОсновнойДолг.ОсновнойДолгВозврат;
		
	КонецЕсли;
	
КонецФункции

Процедура РассчитатьСальдоГрафика(КонтекстГрафика, ЕстьПроценты = Истина, ЕстьКомиссии = Истина, ЕстьШтрафы = Истина) Экспорт
	
	СальдоОсновнойДолг	= 0;
	СальдоПроценты		= 0;
	СальдоКомиссии		= 0;
	СальдоШтрафы = 0;
	
	Для Каждого ТекСтрокаГрафика Из КонтекстГрафика Цикл
		
		СальдоОсновнойДолг = СальдоОсновнойДолг + ТекСтрокаГрафика.ОсновнойДолгПолучение - ТекСтрокаГрафика.ОсновнойДолгВозврат;
		ТекСтрокаГрафика.ОсновнойДолгОстаток = СальдоОсновнойДолг;
		
		Если ЕстьПроценты Тогда
		
			СальдоПроценты = СальдоПроценты + ТекСтрокаГрафика.ПроцентыНачислено - ТекСтрокаГрафика.ПроцентыУплачено;	
			ТекСтрокаГрафика.ПроцентыОстаток = СальдоПроценты;
			
		КонецЕсли;
		
		Если ЕстьКомиссии Тогда
		
			СальдоКомиссии = СальдоКомиссии + ТекСтрокаГрафика.КомиссииНачислено - ТекСтрокаГрафика.КомиссииУплачено;	
			ТекСтрокаГрафика.КомиссииОстаток = СальдоКомиссии;
			
		КонецЕсли;
		
		Если ЕстьШтрафы Тогда
			
			СальдоШтрафы = СальдоШтрафы + ТекСтрокаГрафика.ШтрафыНачислено - ТекСтрокаГрафика.ШтрафыУплачено;
			ТекСтрокаГрафика.ШтрафыОстаток = СальдоШтрафы;
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ПриИзмененииГрафикаНаФорме(Форма, ВерсияФИ, СвернутьГрафик = Истина, РассчитатьСальдо = Истина, ОбновитьИтоги = Истина) Экспорт

	СтрукутураДействий = Новый Структура;
	Если СвернутьГрафик Тогда
		СтрукутураДействий.Вставить("СвернутьГрафик");
	КонецЕсли;
	
	Если РассчитатьСальдо Тогда
		СтрукутураДействий.Вставить("РассчитатьСальдо");
	КонецЕсли;
	
	ПараметрыГрафика = Форма.КэшируемыеЗначения.ПараметрыГрафика;	
	ПараметрыГрафика.Вставить("ТекущийГрафик", ВерсияФИ.График.Выгрузить());
	ВерсияФИ.График.Загрузить(ПолучитьГрафик(СтрукутураДействий, ВерсияФИ, ПараметрыГрафика));
		
	Форма.КэшируемыеЗначения.ПараметрыГрафика.Удалить("ТекущийГрафик");
	
	Если ОбновитьИтоги Тогда
		ФинансовыеИнструментыФормыКлиентСервер.ОбновитьИтогиФормаЦБ(Форма, ВерсияФИ.График);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаГрафика

#КонецОбласти

#Область СчетаУчета

Функция ПолучитьВидФИ(ФИ) Экспорт
	
	ВидФИ = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.ПустаяСсылка");
	Если Не ЗначениеЗаполнено(ФИ) Тогда
		Возврат ВидФИ;
	КонецЕсли;
	
	МдФИ = ФИ.Метаданные();
	ИмяВидФИ = "ВидФинансовогоИнструмента";
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяВидФИ, МдФИ) Тогда
		ВидФИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФИ, ИмяВидФИ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ВидФИ)
		И ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидДоговораУХ", МдФИ) Тогда
		
		ВидФИ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			ФИ, "ВидДоговораУХ.ВидФинансовогоИнструмента");
		
	КонецЕсли;
	
	Возврат ВидФИ;

КонецФункции

Функция СчетаУчетаФиПоВидуФИ(ФИ, ЭтоАктив = Истина) Экспорт
	
	ВидФИ = ПолучитьВидФИ(ФИ);
	
	Если Не ЗначениеЗаполнено(ВидФИ) Тогда
		Возврат Новый Соответствие;
	КонецЕсли;
	
	Возврат ПолучитьСчетаПоВидуФИ(ВидФИ, ЭтоАктив);
	
КонецФункции

Функция ПолучитьСчетаПоВидуФИ(ВидФИ, Актив = Ложь) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	т.Ссылка.ИмяПредопределенныхДанных КАК ИмяСчета,
	|	т.Ссылка КАК ВидСчета,
	|	т.Счет КАК Счет
	|ИЗ
	|	Справочник.ВидыСчетовФИ.ВидыФИ КАК т
	|ГДЕ
	|	т.ВидФИ = &ВидФИ
	|	И т.Актив = &Актив
	|
	|УПОРЯДОЧИТЬ ПО
	|	т.Ссылка.Код");
	
	Запрос.УстановитьПараметр("ВидФИ", ВидФИ);
	Запрос.УстановитьПараметр("Актив", Актив);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.ВидСчета, Новый Структура("Счет,Субконто1,Субконто2,Субконто3", Выборка.Счет));
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетаФИ(ФИ, ИмяДокумента = Неопределено, ЭтоАктив = Истина) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка КАК Ссылка,
	|	3 КАК Приоритет
	|ПОМЕСТИТЬ втВозможныеПараметры
	|ИЗ
	|	Справочник.ПараметрыУчетаФИРСБУ КАК т
	|ГДЕ
	|	т.ФИ = &ФИ
	|	И т.Актив = &Актив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка,
	|	2
	|ИЗ
	|	Справочник.ПараметрыУчетаФИРСБУ КАК т
	|ГДЕ
	|	т.ФИ = &РодительФИ
	|	И т.Актив = &Актив
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Ссылка,
	|	1
	|ИЗ
	|	Справочник.ПараметрыУчетаФИРСБУ КАК т
	|ГДЕ
	|	т.ВидФИ = &ВидФИ
	|	И т.Актив = &Актив
	|	И т.ФИ = НЕОПРЕДЕЛЕНО
	|	И НЕ т.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыФИ.Ссылка КАК ВидСчетаФИ,
	|	ПараметрыУчетаФИРСБУСчетаУчета.Счет КАК Счет,
	|	ПараметрыУчетаФИРСБУСчетаУчета.Субконто1 КАК Субконто1,
	|	ПараметрыУчетаФИРСБУСчетаУчета.Субконто2 КАК Субконто2,
	|	ПараметрыУчетаФИРСБУСчетаУчета.Субконто3 КАК Субконто3
	|ИЗ
	|	Справочник.ВидыСчетовФИ.ВидыФИ КАК ВидыФИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПараметрыУчетаФИРСБУ.СчетаУчета КАК ПараметрыУчетаФИРСБУСчетаУчета
	|		ПО ВидыФИ.Ссылка = ПараметрыУчетаФИРСБУСчетаУчета.ВидСчетаФИ
	|			И (ПараметрыУчетаФИРСБУСчетаУчета.Ссылка В
	|				(ВЫБРАТЬ
	|					т.Ссылка
	|				ИЗ
	|					втВозможныеПараметры КАК т))
	|ГДЕ
	|	ВидыФИ.ВидФИ = &ВидФИ
	|	И ВидыФИ.ВидимостьВДокументах ПОДОБНО &ИмяДокумента
	|	И ВидыФИ.Актив = &Актив";
	
	ЗаполнитьПоВидуДоговора = ТипЗнч(ФИ) = Тип("Структура");
	
	Если ЗаполнитьПоВидуДоговора Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&ВидФИ", "ВЫРАЗИТЬ(&ВидФИ КАК Справочник.ВидыДоговоровКонтрагентовУХ).ВидФинансовогоИнструмента"); 
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("ВидФИ",			ФИ.ВидФинансовогоИнструмента);	
	Запрос.УстановитьПараметр("ФИ", 			?(ЗаполнитьПоВидуДоговора, Null, ФИ));
	Запрос.УстановитьПараметр("РодительФИ", 	ФИ.Родитель);
	Запрос.УстановитьПараметр("Актив", 			ЭтоАктив);
	Запрос.УстановитьПараметр("ИмяДокумента", 	"%" + ИмяДокумента + "%");
	
	Результат = Новый Соответствие;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Результат.Вставить(Выборка.ВидСчетаФИ, 
			Новый Структура("Счет,Субконто1,Субконто2,Субконто3", 
				Выборка.Счет, Выборка.Субконто1, Выборка.Субконто2, Выборка.Субконто3));
				
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСчетУчетаФИ(Организация, ДатаСреза, ФИ) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Счет КАК Счет
	|ИЗ
	|	Документ.ПоступлениеВекселя.СчетаУчета КАК т
	|ГДЕ
	|	т.Ссылка В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ВерсииГрафиковРасчетовСрезПоследних.Регистратор КАК Регистратор
	|			ИЗ
	|				РегистрСведений.ВерсииГрафиковРасчетов.СрезПоследних(&ДатаСреза, Организация = &Организация
	|					И ПредметГрафика = &ФИ
	|					И Регистратор ССЫЛКА Документ.ПоступлениеВекселя) КАК ВерсииГрафиковРасчетовСрезПоследних)
	|	И т.ВидСчетаФИ = ЗНАЧЕНИЕ(Справочник.ВидыСчетовФИ.СчетУчетаФИ)");
		
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаСреза",		ДатаСреза);
	Запрос.УстановитьПараметр("ФИ", 			ФИ);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.ВидыСчетовФИ.ПустаяСсылка();
	Иначе 
		Возврат РезультатЗапроса.Выгрузить()[0].Счет;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область ПодключаемыеКоманды

Функция ПолучитьПараметрыОткрытияФИ(Ссылка, ИдентификаторКоманды) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ЦенныеБумаги") Тогда
		ФИ = Ссылка;
		ЗначенияЗаполнения = Новый Структура("ФинансовыйИнструмент", ФИ);
	Иначе
		ФИ = Ссылка.ФинансовыйИнструмент;
		ЗначенияЗаполнения = Новый Структура("ФинансовыйИнструмент,ДокументОснование", ФИ, Ссылка);		
	КонецЕсли;
	ВидФИ = ФИ.ВидФинансовогоИнструмента;
		
	Если ИдентификаторКоманды = "ВыпускЦеннойБумаги" Тогда
		
		ИмяФормы = "Документ.ВыпускЦеннойБумаги.ФормаОбъекта";
		Если ВидФИ = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.Вексель") Тогда
			ИмяФормы = "Документ.ПоступлениеВекселя.ФормаОбъекта";
			Если ФИ.ПараметрыЦеннойБумаги.ФормаВекселя = ПредопределенноеЗначение("Перечисление.ФормаВекселя.Переводной") Тогда
				ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВекселя.ВыпускПереводныхВекселей"));
			Иначе	
				ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВекселя.ВыпускПростыхВекселей"));
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИдентификаторКоманды = "ВыкупЦеннойБумаги" Тогда	
		
		ИмяФормы = "Документ.ВыкупЦеннойБумаги.ФормаОбъекта";
		Если ВидФИ = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.Вексель") Тогда
			ИмяФормы = "Документ.ВыбытиеВекселей.ФормаОбъекта";
			ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВыбытиеВекселя.ПогашениеВекселя"));			
		КонецЕсли;
		
	ИначеЕсли ИдентификаторКоманды = "ПриобретениеЦеннойБумаги" Тогда	
		
		ИмяФормы = "Документ.ПриобретениеЦеннойБумаги.ФормаОбъекта";
		Если ВидФИ = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.Вексель") Тогда
			ИмяФормы = "Документ.ПоступлениеВекселя.ФормаОбъекта";
			ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеВекселя.ПриобретениеВекселей"));			
		КонецЕсли;
				
	ИначеЕсли ИдентификаторКоманды = "ПродажаЦеннойБумаги" Тогда
		
		ИмяФормы = "Документ.ПродажаЦеннойБумаги.ФормаОбъекта";
		Если ВидФИ = ПредопределенноеЗначение("Перечисление.ВидыФинансовыхИнструментов.Вексель") Тогда
			ИмяФормы = "Документ.ВыбытиеВекселей.ФормаОбъекта";
			ЗначенияЗаполнения.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийВыбытиеВекселя.ПродажаВекселя"));			
		КонецЕсли;
		
	ИначеЕсли ИдентификаторКоманды = "ОплатаЦеннойБумаги" Тогда	
		
		ИмяФормы = ВстраиваниеУХФинансовыеИнструменты.ИмяФормыОплатаЦБ();
		ЗначенияЗаполнения.Вставить("ИдентификаторКоманды", "ОплатаЦеннойБумаги");
		
	КонецЕсли;

	Возврат Новый Структура("ИмяФормы,ЗначенияЗаполнения", ИмяФормы, ЗначенияЗаполнения);
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыФормы

Процедура ДобавитьУсловноеОформлениеФакта(Форма, ДатаФакта = Неопределено) Экспорт

КонецПроцедуры

#КонецОбласти
 
#Область ОбновитьГрафикиЦБ

// См. МСФОУХ.ПриОпределенииВидовПодключаемыхКоманд
Процедура ОбновитьГрафикиПоКотировке_Подключаемый(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт

	ФинансовыеИнструментыУХ.АктуализироватьГрафикиЦенныхБумаг(
		ТекущаяДата(), ПараметрКоманды);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКэшируемыеЗначения(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения)

	Если Не СтруктураДействий.Свойство("ЗаполнитьКэшируемыеЗначения") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЦеннойБумаги = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СтрокаЦБ.ФинансовыйИнструмент, "Номинал,ВидФинансовогоИнструмента,ПараметрыЦеннойБумаги");
	
	Номинал 					= ?(ЗначениеЗаполнено(ДанныеЦеннойБумаги.Номинал), ДанныеЦеннойБумаги.Номинал, 0);//приводим к числу
	ДатаДокумента 				= НачалоДня(КэшируемыеЗначения.КонтекстДокумента.Дата);//купон выплачивается в конце дня	
	ДатаНачалаКупонногоПериода 	= Дата(1,1,1);
	ДатаВыплатыКупона 			= Дата(3999,12,31);
	ТекущийКупон 				= 0;
		
	Если ЗначениеЗаполнено(ДанныеЦеннойБумаги) 
		И ТипЗнч(ДанныеЦеннойБумаги.ПараметрыЦеннойБумаги) = Тип("ДокументСсылка.ВерсияГрафикаЦеннойБумаги")
		И ДанныеЦеннойБумаги.ПараметрыЦеннойБумаги.График.Количество() Тогда
		
		ТабличнаяЧастьГрафик = ДанныеЦеннойБумаги.ПараметрыЦеннойБумаги.График;
		
		ДатаНачалаКупонногоПериода 	= ТабличнаяЧастьГрафик[0].Дата;
		ДатаВыплатыКупона 			= ТабличнаяЧастьГрафик[ТабличнаяЧастьГрафик.Количество() - 1].Дата;
	 
		Для Инд = 0 По ТабличнаяЧастьГрафик.Количество() - 1 Цикл
			
			ТекущаяСтрока = ТабличнаяЧастьГрафик[Инд];
			Если ТекущаяСтрока.Дата < ДатаДокумента Тогда
				Продолжить;//ищем текущую строку в графике
			КонецЕсли;
			
			Если Инд = 0 Тогда
				ПредыдущаяСтрока = ТекущаяСтрока;
			Иначе
				ПредыдущаяСтрока = ТабличнаяЧастьГрафик[Инд-1];
			КонецЕсли;
			
			ДатаНачалаКупонногоПериода 	= ПредыдущаяСтрока.Дата;
			Номинал 					= ПредыдущаяСтрока.ОсновнойДолгОстаток;
			Если ТекущаяСтрока.Дата = ДатаДокумента Тогда
				Номинал = ТекущаяСтрока.ОсновнойДолгОстаток;
			КонецЕсли;
			
			Для й = инд По ТабличнаяЧастьГрафик.Количество() - 1 Цикл //ищем строку погашения купона
				СтрокаВыплатыКупона = ТабличнаяЧастьГрафик[й];
				Если СтрокаВыплатыКупона.ПроцентыУплачено <> 0 Тогда
					ДатаВыплатыКупона 	= СтрокаВыплатыКупона.Дата;
					ТекущийКупон		= СтрокаВыплатыКупона.ПроцентыУплачено;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Прервать;
			
		КонецЦикла;
	КонецЕсли;
	
	КурсРасчетовИзНоминала = 1;
	Если ЗначениеЗаполнено(СтрокаЦБ.ДоговорКонтрагента)
		И ЗначениеЗаполнено(СтрокаЦБ.ФинансовыйИнструмент)
		И ЗначениеЗаполнено(СтрокаЦБ.Дата) Тогда
	
		ВалютаРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаЦБ.ДоговорКонтрагента, "ВалютаВзаиморасчетов");
		ВалютаНоминала = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			СтрокаЦБ.ФинансовыйИнструмент, "ВалютаНоминала");
			
		Если ЗначениеЗаполнено(ВалютаНоминала) И ЗначениеЗаполнено(ВалютаРасчетов) Тогда
			//1000000 дает необходимую точность
			КурсРасчетовИзНоминала = РаботаСКурсамиВалют.ПересчитатьВВалюту(
				1000000, ВалютаНоминала, ВалютаРасчетов, СтрокаЦБ.Дата)/1000000;
			
		КонецЕсли;
			
	КонецЕсли;
	
	КэшируемыеЗначения.Вставить("ДатаНачалаКупонногоПериода",	ДатаНачалаКупонногоПериода);
	КэшируемыеЗначения.Вставить("ДатаВыплатыКупона", 			ДатаВыплатыКупона);
	КэшируемыеЗначения.Вставить("Номинал", 						Номинал);
	КэшируемыеЗначения.Вставить("ТекущийКупон", 				ТекущийКупон);
	КэшируемыеЗначения.Вставить("КурсРасчетовИзНоминала", 		КурсРасчетовИзНоминала);
	
КонецПроцедуры

Процедура ЗаполнитьКоличество(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения)

	Если Не СтруктураДействий.Свойство("ЗаполнитьКоличество") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаЦБ.Количество = ОбщегоНазначенияУХ.ПолучитьЗначениеРеквизита(СтрокаЦБ.ФинансовыйИнструмент, "Количетво");

КонецПроцедуры

Процедура ЗаполнитьНКД(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения)

	ЗначенияДействия = Неопределено;
	
	Если Не СтруктураДействий.Свойство("ЗаполнитьНКД", ЗначенияДействия) Тогда
		Возврат;
	КонецЕсли;
	
	НКД_Ед = ФинансоваяМатематика.ПолучитьНКД(
		КэшируемыеЗначения.ТекущийКупон, 
		КэшируемыеЗначения.КонтекстДокумента.Дата,
		КэшируемыеЗначения.ДатаВыплатыКупона,
		КэшируемыеЗначения.ДатаНачалаКупонногоПериода,
		Неопределено);
	
	СтрокаЦБ.НКД = СтрокаЦБ.Количество
		* НКД_Ед
		* КэшируемыеЗначения.КурсРасчетовИзНоминала;

КонецПроцедуры

Процедура РассчитатьСтоимостьНоминала(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения)

	Если Не СтруктураДействий.Свойство("РассчитатьСтоимостьНоминала") Тогда
		Возврат;
	КонецЕсли;
	
	СтоимостьНоминала = СтрокаЦБ.Количество 
		* КэшируемыеЗначения.Номинал 
		* КэшируемыеЗначения.КурсРасчетовИзНоминала;
	
	КэшируемыеЗначения.Вставить("СтоимостьНоминала", СтоимостьНоминала);
	
КонецПроцедуры

Процедура РассчитатьПремию(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения)
	
	Если Не СтруктураДействий.Свойство("РассчитатьПремию") Тогда
		Возврат;
	КонецЕсли;
	
	СтоимостьНоминала = СтрокаЦБ.Количество 
		* КэшируемыеЗначения.Номинал 
		* КэшируемыеЗначения.КурсРасчетовИзНоминала;
		
	СтрокаЦБ.Премия = СтрокаЦБ.Стоимость - СтоимостьНоминала - СтрокаЦБ.НКД;
	
КонецПроцедуры

Процедура РассчитатьСтоимость(СтрокаЦБ, СтруктураДействий, КэшируемыеЗначения)
	
	Если Не СтруктураДействий.Свойство("РассчитатьСтоимость") Тогда
		Возврат;
	КонецЕсли;
	
	СтоимостьНоминала = СтрокаЦБ.Количество 
		* КэшируемыеЗначения.Номинал 
		* КэшируемыеЗначения.КурсРасчетовИзНоминала;
		
	СтрокаЦБ.Стоимость = СтрокаЦБ.Премия + СтоимостьНоминала + СтрокаЦБ.НКД;
	
КонецПроцедуры

Функция СоздатьШаблонГрафика(ЕстьПроценты, ЕстьКомиссии, ЕстьШтрафы)
	
	ТабГрафик = Новый ТаблицаЗначений;		
	
	отДата = ОбщегоНазначенияУХ.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя);
	отЧисло = ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(18,2);
	
	ТабГрафик.Колонки.Добавить("Дата", отДата);
	ТабГрафик.Колонки.Добавить("ОсновнойДолгПолучение", отЧисло);
	ТабГрафик.Колонки.Добавить("ОсновнойДолгВозврат", отЧисло);
	
	Если ЕстьПроценты Тогда
		ТабГрафик.Колонки.Добавить("ПроцентыНачислено", отЧисло);
		ТабГрафик.Колонки.Добавить("ПроцентыУплачено", отЧисло);
	КонецЕсли;
	
	Если ЕстьКомиссии Тогда
		ТабГрафик.Колонки.Добавить("КомиссииНачислено", отЧисло);
		ТабГрафик.Колонки.Добавить("КомиссииУплачено", отЧисло);
	КонецЕсли;
	
	Если ЕстьШтрафы Тогда
		ТабГрафик.Колонки.Добавить("КомиссииНачислено", отЧисло);
		ТабГрафик.Колонки.Добавить("КомиссииУплачено", отЧисло);
	КонецЕсли;
	
	Возврат ТабГрафик;

КонецФункции

Процедура СвернутьГрафик(График, ЕстьПроценты = Истина, ЕстьКомиссии = Истина, ЕстьШтрафы = Истина)
	
	КолонкиСумм = "ОсновнойДолгПолучение,ОсновнойДолгВозврат" 
					+ ?(ЕстьПроценты, 	",ПроцентыНачислено,ПроцентыУплачено", 	"")
					+ ?(ЕстьКомиссии,	",КомиссииНачислено,КомиссииУплачено",	"")
					+ ?(ЕстьШтрафы, 	",ШтрафыНачислено,ШтрафыУплачено", 		"");
	
	График.Свернуть("Дата", КолонкиСумм);
	График.Сортировать("Дата");
	
	отЧисло = ОбщегоНазначенияУХ.ПолучитьОписаниеТиповЧисла(18, 2);
	
	График.Колонки.Добавить("ОсновнойДолгОстаток", отЧисло);
	
	Если ЕстьПроценты Тогда
		График.Колонки.Добавить("ПроцентыОстаток", отЧисло);
	КонецЕсли;
	
	Если ЕстьКомиссии Тогда
		График.Колонки.Добавить("КомиссииОстаток", отЧисло);
	КонецЕсли;
	
	Если ЕстьШтрафы Тогда
		График.Колонки.Добавить("ШтрафыОстаток", отЧисло);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
